# Приклад управління пам'яттю в Ruby

# Пусті перемінні-вказівники

a = nil
b = nil
c = nil

# Перемінна <a> посилається на масив, тому перемінні <b> та <c> також посилаються на масив

a = []
b = a
c = b

# Заповнення масиву у циклі

30_000_000.times do |i|
	a << "Строка № #{i}"
end

# Перемінна <a> обнулена, але на масив також посилаються перемінні <b> та <c>,
# тому збірник сміття не очистить пам'ять

a = nil
GC.start

# Усі перемінні обнулені, на масив не залишилося посилань, тому збірник сміття
# очистить масив і звільнить пам'ять

b = nil
c = nil
GC.start