class Print_result_v1

# Метод відображає статус гри
# Написи згенеровані за допомогою сайту http://www.network-science.de/ascii/

def show_Status (core)

	clear()
	puts "Гра \"Вгадай слово\" v2.0"
	puts "\n"

	puts "Слово: " + get_Word_For_Print(core.mystery_word, core.good_letters)

	if (core.mystery_word.uniq.size == core.good_letters.size)
		abort "
#     # ####### #     #    #     # ### #     # 
 #   #  #     # #     #    #  #  #  #  ##    # 
  # #   #     # #     #    #  #  #  #  # #   # 
   #    #     # #     #    #  #  #  #  #  #  # 
   #    #     # #     #    #  #  #  #  #   # # 
   #    #     # #     #    #  #  #  #  #    ## 
   #    #######  #####      ## ##  ### #     #
\n"

	elsif (core.errors_count >= 7)
		abort "
 #####     #    #     # #######    ####### #     # ####### ######  
#     #   # #   ##   ## #          #     # #     # #       #     # 
#        #   #  # # # # #          #     # #     # #       #     # 
#  #### #     # #  #  # #####      #     # #     # #####   ######  
#     # ####### #     # #          #     #  #   #  #       #   #   
#     # #     # #     # #          #     #   # #   #       #    #  
 #####  #     # #     # #######    #######    #    ####### #     #
\n"
	end

	wrong_letters = ""
	if (core.errors_count > 0) 
		wrong_letters = ": [#{core.bad_letters.join(", ")}]"
	end

	show_Errors_Count(core)

end

# Метод очищує консоль

def clear()

	system "clear" or system "cls"

end

# Метод виводить слово із відображенням відгаданих та невідгаданих літер

def get_Word_For_Print (mystery_word, good_letters)

	result = ""

	for letter in mystery_word do
		if (good_letters.include?(letter))
			result += letter + " "
		else
			result += "__ "
		end
	end

	return result	

end

# Метод відображає кількість помилок

def show_Errors_Count (core)

	case (core.errors_count)

	when 0
		puts "
####### ######  ######  ####### ######   #####       ###   
#       #     # #     # #     # #     # #     #     #   #  
#       #     # #     # #     # #     # #          #     # 
#####   ######  ######  #     # ######   #####     #     # 
#       #   #   #   #   #     # #   #         #    #     # 
#       #    #  #    #  #     # #    #  #     #     #   #  
####### #     # #     # ####### #     #  #####       ###   "

	when 1
		puts "
####### ######  ######  ####### ######   #####        #   
#       #     # #     # #     # #     # #     #      ##   
#       #     # #     # #     # #     # #           # #   
#####   ######  ######  #     # ######   #####        #   
#       #   #   #   #   #     # #   #         #       #   
#       #    #  #    #  #     # #    #  #     #       #   
####### #     # #     # ####### #     #  #####      ##### "

	when 2
		puts "
####### ######  ######  ####### ######   #####      #####  
#       #     # #     # #     # #     # #     #    #     # 
#       #     # #     # #     # #     # #                # 
#####   ######  ######  #     # ######   #####      #####  
#       #   #   #   #   #     # #   #         #    #       
#       #    #  #    #  #     # #    #  #     #    #       
####### #     # #     # ####### #     #  #####     ####### "

	when 3
		puts "
####### ######  ######  ####### ######   #####      #####  
#       #     # #     # #     # #     # #     #    #     # 
#       #     # #     # #     # #     # #                # 
#####   ######  ######  #     # ######   #####      #####  
#       #   #   #   #   #     # #   #         #          # 
#       #    #  #    #  #     # #    #  #     #    #     # 
####### #     # #     # ####### #     #  #####      #####  "

	when 4
		puts "
####### ######  ######  ####### ######   #####     #       
#       #     # #     # #     # #     # #     #    #    #  
#       #     # #     # #     # #     # #          #    #  
#####   ######  ######  #     # ######   #####     #    #  
#       #   #   #   #   #     # #   #         #    ####### 
#       #    #  #    #  #     # #    #  #     #         #  
####### #     # #     # ####### #     #  #####          #  "

	when 5
		puts "
####### ######  ######  ####### ######   #####     ####### 
#       #     # #     # #     # #     # #     #    #       
#       #     # #     # #     # #     # #          #       
#####   ######  ######  #     # ######   #####     ######  
#       #   #   #   #   #     # #   #         #          # 
#       #    #  #    #  #     # #    #  #     #    #     # 
####### #     # #     # ####### #     #  #####      #####  "

	when 6
		puts "
####### ######  ######  ####### ######   #####      #####  
#       #     # #     # #     # #     # #     #    #     # 
#       #     # #     # #     # #     # #          #       
#####   ######  ######  #     # ######   #####     ######  
#       #   #   #   #   #     # #   #         #    #     # 
#       #    #  #    #  #     # #    #  #     #    #     # 
####### #     # #     # ####### #     #  #####      #####  "

	end
end

# Кінець класу <Print_result_v1>

end