# Масив <answers>, який містить усі можливі відповіді
answers = [

# Позитивні відповіді
"Безперечно",
"Долею визначено",
"Жодних сумнівів",
"Безумовно так",
"Можеш бути впевнений у цьому",

# Нерішуче позитивні відповіді
"Мені здається - «так»",
"Найімовірніше",
"Хороші перспективи",
"Знаки кажуть - «так»",
"Так",

# Нейтральні відповіді
"Поки не ясно, спробуй знову",
"Запитай пізніше",
"Краще тобі цього не знати",
"Зараз не можна передбачити",
"Сконцентруйся і запитай знову",

# Негативні відповіді
"Навіть не думай",
"Моя відповідь - «ні»",
"За моїми даними - «ні»",
"Перспективи не дуже хороші",
"Вельми сумнівно"

]

# Метод <sample> повертає випадкове значення із масиву
puts answers.sample