# Команда <sleep> призупиняє програму на задану кількість секунд

puts "Повідомлення №1"
puts "Пауза 0,5 сек."
sleep 0.5
puts "Повідомлення №2"
puts "Пауза 1,5 сек."
sleep 1.5
puts "Повідомлення №3"
puts "\n"

# Масив значень типу "строка"
fruits = ["Яблуко", "Помаранч", "Банан"]

puts "Масив: " + fruits.to_s
puts "Розмір масиву: " + fruits.length.to_s + " елементи"

# Різні варіанти додавання елементів у масив

fruits << "Вишня"
fruits.push("Грушка")
fruits.push("Лимон", "Ківі")

puts "Масив: " + fruits.to_s
puts "Розмір масиву: " + fruits.length.to_s + " елементів"

# Отримання елемента по індексу

puts "Перший елемент масиву: " + fruits[0] # Перший елемент
puts "П'ятий елемент масиву: " + fruits[4] # П'ятий елемент

# Різні варіанти видалення елементів масиву

fruits.delete("Грушка")
fruits.delete_at(2)

puts "Масив: " + fruits.to_s
puts "Розмір масиву: " + fruits.length.to_s + " елементів"